---
kind: type
id: T:Autodesk.Revit.DB.AssemblyMemberDifferentType
source: html/12b0c348-9e86-f5f0-ed28-bd8be688c937.htm
---
# Autodesk.Revit.DB.AssemblyMemberDifferentType

The two assembly members being compared have different type

## Syntax (C#)
```csharp
public class AssemblyMemberDifferentType : AssemblyMemberDifference
```